Repository: NaN-tic/trytond-sale_supply_production
Catalog: locale/*.po
Languages: ca, es, es_es

# field:product.product,supply_production_on_sale:
source: Supply Production On Sale
ca: Subministrament de producció en venda
es: Producción de suministros en venta

# field:product.template,supply_production_on_sale:
source: Supply Production On Sale
ca: Subministrament de producció en venda
es: Producción de suministros en venta

# field:production.change_quantity.start,current_quantity:
source: Current Quantity
ca: Quantitat actual
es: Cantidad actual
es_es: Cantidad actual

# field:production.change_quantity.start,new_quantity:
source: New Quantity
ca: Noca quantitat
es: Nueva cantidad
es_es: Nueva cantidad

# field:production.change_quantity.start,production:
source: Production
ca: Producció
es: Producciones
es_es: Producción

# field:production.change_quantity.start,sale_line:
source: Sale Line
ca: Línia de venta
es: Línea de venta
es_es: Línea de venta

# field:production.change_quantity.start,uom:
source: Uom
ca: UdM
es: UdM
es_es: UdM

# field:sale.configuration,sale_supply_production_default:
source: Sale Line Supply Production
ca: Producció de subministrament de línia de venda
es: Producción de suministro de línea de venta

# field:sale.line,productions:
source: Productions
ca: Produccions
es: Producciones
es_es: Producciones

# field:sale.line,supply_production:
source: Supply Production
ca: Producció de subministrament
es: Producción de suministro

# field:sale.sale,productions:
source: Productions
ca: Produccions
es: Producciones
es_es: Producciones

# help:sale.configuration,sale_supply_production_default:
source: Default Supply Production value for Sale Lines
ca: Valor de producció de subministrament per defecte per a les línies de venda
es: Valor predeterminado de producción de suministro para líneas de venta

# model:ir.action,name:act_production_form
source: Productions
ca: Produccions
es: Producciones
es_es: Producciones

# model:ir.action,name:wizard_production_change_quantity
source: Change Sale Quantity
ca: Canviar la quantitat de venda
es: Cambiar la cantidad de venta

# model:ir.message,text:cannot_create_productions_missing_bom
source: No production can be created because Product Cost Plan "%(cost_plan)s" has no BOM assigned.
ca: No es pot crear la producció perquè el pla de costos del producte "%(cost_plan)s" no té una llista de materials assignada.
es: No se puede crear la producción porque el plan de costes del producto "%(cost_plan)s" no tiene una lista de materiales asignada.

# model:ir.message,text:invalid_production_state
source: You cannot modify the quantity of Production "%(production)s" because it is not in state "Draft" or "Waiting".
ca: No pot modificar la quantitat de la producció "%(production)s" perquè no està en estat "Esborrany" o "En espera".
es: No puede modificar la cantidad de la producción "%(production)s" porque no está en estado "Borrador" o "En espera".

# model:ir.message,text:missing_cost_plan
source: There are some lines of sale "%(sale)s" does not have Cost Plan, so it will not generate any production.
ca: Hi han algunes línies de la venda "%(sale)s " que no té un pla de costos, de manera que no generarà cap producció.
es: Hay algunas líneas de la venta "%(sale)s" no tiene un plan de costes, por lo que no generará ninguna producción.

# model:ir.message,text:no_updateable_productions
source: There is no updateable production available!
ca: No hi ha cap producció actualitzable disponible.
es: ¡No hay producción actualizable disponible!

# model:ir.message,text:production_no_related_to_sale
source: The Production "%(production)s" is not related to any sale. In this case, you can't use this wizard but you can modify the quantity directly in production's form.
ca: La producció "%(production)s" no està relacionada amb cap venda. En aquest cas, no podeu utilitzar aquest assistent, però podeu modificar la quantitat directament al formulari de producció.
es: La producción «%(production)s» no está relacionada con ninguna venta. En este caso, no puede usar este asistente, pero puede modificar la cantidad directamente en el formulario de producción.

# model:ir.message,text:production_with_same_origin
source: Cannot change Sale Line quantity because there ara more than one production "%(productions)s" with same Sale line "%(sale_line)s"
ca: No es pot canviar la quantitat de la venda perque hi ha més d'una producció "%(productions)s" amb la mateixa línia de venda "%(sale_line)s"
es: No se puede cambiar la cantidad de la línia de venda porque hay más de una producción "%(productions)s" con la misma línia "%(sale_line)s"

# model:ir.message,text:quantity_already_produced
source: Quantity already produced!
ca: Quantitat ja produïda!
es: ¡Cantidad ya producida!

# model:production.change_quantity.start,string:
source: Production Change Quantity Start
ca: Inici de la quantitat de canvi de producció
es: Cambio de producción Cantidad inicial

# view:production.change_quantity.start:
source: It will change the quantity of the origin sale line which has been confirmed by the customer. The original one will be mantained in the Confirmed Quantity field.
ca: Canviarà la quantitat del origen de la línia de venda que ha estat confirmada pel client. L'original es mantindrà al camp quantitat confirmada.
es: Cambiará la cantidad de la línea de venta de origen que haya sido confirmada por el cliente. El original se mantendrá en el campo cantidad confirmada.

# view:sale.sale:
source: Productions
ca: Produccions
es: Producciones
es_es: Producciones

# wizard_button:production.change_quantity,start,end:
source: Cancel
ca: Cancel·la
es: Cancelar
es_es: Cancel·lar

# wizard_button:production.change_quantity,start,modify:
source: Modify
ca: Modificar
es: Modificar
es_es: Modificar

# error:product.cost.plan:
source: No production can be created because Product Cost Plan "%s" has no BOM assigned.
es_es: No se puede crear la producción porque el plan de costes "%s" no tiene LdM asociada.

# error:production.change_quantity:
source: The Production "%s" is not related to any sale. In this case, you can't use this wizard but you can modify the quantity directly in production's form.
es_es: La producción "%s" no está asociada a ninguna venta.

# error:production.change_quantity:
source: You cannot modify the quantity of Production "%s" because it is not in state "Draft" or "Waiting".
es_es: No puede modificar la cantidad de la producción "%s" porque no se encuentra en los estados "Borrador" ni "En espera".

# error:sale.change_line_quantity:
source: Quantity already produced!
es_es: ¡Ya se ha producido esta cantidad!

# error:sale.change_line_quantity:
source: There is no updateable production available!
es_es: ¡No hay producciones modificables!

# error:sale.sale:
source: The line "%(line)s" of sale "%(sale)s" doesn't have Cost Plan, so it won't generate any production.
es_es: La línea "%(line)s" de la venta "%(sale)s" no tiene Plan de coste, por lo que no se generará ninguna producción.

# field:production,cost_plan:
source: Cost Plan
es_es: Plan de costes

# field:production.change_quantity.start,id:
source: ID
es_es: Identificador

# field:production.change_quantity.start,unit_digits:
source: Unit Digits
es_es: Dígitos unidad

# field:sale.line,cost_plan:
source: Cost Plan
es_es: Plan de costes

# model:ir.action,name:wizard_production_change_quantity
source: Change Sale Quantity
es_es: Modificar cantidad venta

# model:production.change_quantity.start,name:
source: Change Production Quantity - Start
es_es: Modificar cantidad producción - Inicio

# view:production.change_quantity.start:
source: Change Sale Quantity
es_es: Modificar cantidad venta

# view:production.change_quantity.start:
source: It will change the quantity of the origin sale line which has been confirmed by the customer. The orinal one will be mantained in the Confirmed Quantity field.
es_es: Se modificará la cantidad de la línea de venta de origen, la cual fue confirmada por el cliente. La original se mantendrá en el campo Cantidad confirmada.
